truongtl/ch32v00x-hal-driver/src/ch32v00x_hal_uart.c
/********************************** (C) COPYRIGHT  *******************************
 * File Name          : ch32v00x_hal_uart.c
 * Author             : truongtl
 * Version            : V1.0
 * Date               : 2025/09/28
 * Description        : UART HAL module driver.
 *                      This file provides hardware abstract interface to manage all UART functions
 *********************************************************************************
 * Copyright (c) 2025 Developed by truongtl (Truong Tran)
 *******************************************************************************/
/* Includes ------------------------------------------------------------------*/
#include <ch32v00x_hal.h>
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
#define USART_CTLR1_CLEAR_Mask          ((uint16_t)0xE9F3)      /* USART CTLR1 Mask */
#define USART_CTLR3_CLEAR_Mask          ((uint16_t)0xFCFF)      /* USART CTLR3 Mask */
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
static HAL_StatusTypeDef UART_WaitOnFlagUntilTimeout(UART_HandleTypeDef *huart, uint32_t Flag, FlagStatus Status,
                                                     uint32_t Tickstart, uint32_t Timeout);
static HAL_StatusTypeDef UART_Start_Receive_IT(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size);
static void UART_EndRxTransfer(UART_HandleTypeDef *huart);
static HAL_StatusTypeDef UART_Transmit_IT(UART_HandleTypeDef *huart);
static HAL_StatusTypeDef UART_EndTransmit_IT(UART_HandleTypeDef *huart);
static HAL_StatusTypeDef UART_Receive_IT(UART_HandleTypeDef *huart);
/* Exported functions ---------------------------------------------------------*/
/**
  * @brief  Initializes the UART mode according to the specified parameters in
  *         the UART_InitTypeDef and create the associated handle.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_Init(UART_HandleTypeDef *huart)
{
    /* Check the UART handle allocation */
    if (huart == NULL)
    {
        return HAL_ERROR;
    }

    /* Check the parameters */
    HAL_PARAM_CHECK(IS_UART_INSTANCE(huart->Instance));
    HAL_PARAM_CHECK(IS_UART_WORD_LENGTH(huart->Init.UART_WordLength));
    HAL_PARAM_CHECK(IS_UART_STOPBITS(huart->Init.UART_StopBits));
    HAL_PARAM_CHECK(IS_UART_PARITY(huart->Init.UART_Parity));
    HAL_PARAM_CHECK(IS_UART_HWCONTROL(huart->Init.UART_HardwareFlowControl));
    HAL_PARAM_CHECK(IS_UART_MODE(huart->Init.UART_Mode));

    uint32_t          tmpreg = 0x00, apbclock = 0x00;
    uint32_t          integerdivider = 0x00;
    uint32_t          fractionaldivider = 0x00;
    uint32_t          usartxbase = 0;
    RCC_ClocksTypeDef RCC_ClocksStatus;

    if (huart->gState == HAL_UART_STATE_RESET)
    {
        /* Init the low level hardware : GPIO, CLOCK */
        HAL_UART_MspInit(huart);
    }

    huart->gState = HAL_UART_STATE_BUSY;

    /* Disable the peripheral */
    __HAL_UART_DISABLE(huart);

    if (huart->Init.UART_HardwareFlowControl != UART_HWCONTROL_NONE)
    {
    }

    usartxbase = (uint32_t)huart->Instance;
    tmpreg = READ_REG(huart->Instance->CTLR2);
    tmpreg &= ~USART_CTLR2_STOP;
    tmpreg |= (uint32_t)huart->Init.UART_StopBits;

    WRITE_REG(huart->Instance->CTLR2, (uint16_t)tmpreg);
    tmpreg = READ_REG(huart->Instance->CTLR1);
    tmpreg &= USART_CTLR1_CLEAR_Mask;
    tmpreg |= (uint32_t)huart->Init.UART_WordLength | huart->Init.UART_Parity |
              huart->Init.UART_Mode;
    WRITE_REG(huart->Instance->CTLR1, (uint16_t)tmpreg);

    tmpreg = READ_REG(huart->Instance->CTLR3);
    tmpreg &= USART_CTLR3_CLEAR_Mask;
    tmpreg |= huart->Init.UART_HardwareFlowControl;
    WRITE_REG(huart->Instance->CTLR3, (uint16_t)tmpreg);

    HAL_RCC_GetClocksFreq(&RCC_ClocksStatus);

    if (usartxbase == USART1_BASE)
    {
        apbclock = RCC_ClocksStatus.PCLK2_Frequency;
    }
    else
    {
        apbclock = RCC_ClocksStatus.PCLK1_Frequency;
    }

    integerdivider = ((25 * apbclock) / (4 * (huart->Init.UART_BaudRate)));
    tmpreg = (integerdivider / 100) << 4;
    fractionaldivider = integerdivider - (100 * (tmpreg >> 4));
    tmpreg |= ((((fractionaldivider * 16) + 50) / 100)) & ((uint8_t)0x0F);

    WRITE_REG(huart->Instance->BRR, (uint16_t)tmpreg);

    /* Enable the peripheral */
    __HAL_UART_ENABLE(huart);

    /* Initialize the UART state */
    huart->ErrorCode = HAL_UART_ERROR_NONE;
    huart->gState = HAL_UART_STATE_READY;
    huart->RxState = HAL_UART_STATE_READY;

    return HAL_OK;
}

/**
  * @brief  UART MSP Init.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval None
  */
__weak void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(huart);
    /* NOTE: This function should not be modified, when the callback is needed,
            the HAL_UART_MspInit could be implemented in the user file
    */
}

/**
  * @brief  Sends an amount of data in blocking mode.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 provided through pData.
  * @param  huart Pointer to a UART_HandleTypeDef structure that contains
  *               the configuration information for the specified UART module.
  * @param  pData Pointer to data buffer (u8 or u16 data elements).
  * @param  Size  Amount of data elements (u8 or u16) to be sent
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_Transmit(UART_HandleTypeDef *huart, const uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
    const uint8_t  *pdata8bits;
    const uint16_t *pdata16bits;
    uint32_t tickstart = 0U;

