truongtl/ch32v00x-hal-driver/src/ch32v00x_hal_uart.c
    /* Check that a Tx process is not already ongoing */
    if (huart->gState == HAL_UART_STATE_READY)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return  HAL_ERROR;
        }

        huart->ErrorCode = HAL_UART_ERROR_NONE;
        huart->gState = HAL_UART_STATE_BUSY_TX;

        /* Init tickstart for timeout management */
        tickstart = HAL_GetTick();

        huart->TxXferSize = Size;
        huart->TxXferCount = Size;

        /* In case of 9bits/No Parity transfer, pData needs to be handled as a uint16_t pointer */
        if ((huart->Init.UART_WordLength == UART_WORDLENGTH_9B) && (huart->Init.UART_Parity == UART_PARITY_NONE))
        {
            pdata8bits  = NULL;
            pdata16bits = (const uint16_t *) pData;
        }
        else
        {
            pdata8bits  = pData;
            pdata16bits = NULL;
        }

        while (huart->TxXferCount > 0U)
        {
            if (UART_WaitOnFlagUntilTimeout(huart, UART_FLAG_TXE, RESET, tickstart, Timeout) != HAL_OK)
            {
                huart->gState = HAL_UART_STATE_READY;

                return HAL_TIMEOUT;
            }

            if (pdata8bits == NULL)
            {
                WRITE_REG(huart->Instance->DATAR, (uint16_t)(*pdata16bits & 0x01FFU));
                pdata16bits++;
            }
            else
            {
                WRITE_REG(huart->Instance->DATAR, (uint8_t)(*pdata8bits & 0xFFU));
                pdata8bits++;
            }

            huart->TxXferCount--;
        }

        if (UART_WaitOnFlagUntilTimeout(huart, UART_FLAG_TC, RESET, tickstart, Timeout) != HAL_OK)
        {
            huart->gState = HAL_UART_STATE_READY;

            return HAL_TIMEOUT;
        }

        /* At end of Tx process, restore huart->gState to Ready */
        huart->gState = HAL_UART_STATE_READY;

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Receives an amount of data in blocking mode.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the received data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 available through pData.
  * @param  huart Pointer to a UART_HandleTypeDef structure that contains
  *               the configuration information for the specified UART module.
  * @param  pData Pointer to data buffer (u8 or u16 data elements).
  * @param  Size  Amount of data elements (u8 or u16) to be received.
  * @param  Timeout Timeout duration
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_Receive(UART_HandleTypeDef *huart, uint8_t *pData, uint16_t Size, uint32_t Timeout)
{
    uint8_t  *pdata8bits;
    uint16_t *pdata16bits;
    uint32_t tickstart = 0U;

    /* Check that a Rx process is not already ongoing */
    if (huart->RxState == HAL_UART_STATE_READY)
    {
        if ((pData == NULL) || (Size == 0U))
        {
            return HAL_ERROR;
        }

        huart->ErrorCode = HAL_UART_ERROR_NONE;
        huart->RxState = HAL_UART_STATE_BUSY_RX;

        /* Init tickstart for timeout management */
        tickstart = HAL_GetTick();

        huart->RxXferSize = Size;
        huart->RxXferCount = Size;

        /* In case of 9bits/No Parity transfer, pRxData needs to be handled as a uint16_t pointer */
        if ((huart->Init.UART_WordLength == UART_WORDLENGTH_9B) && (huart->Init.UART_Parity == UART_PARITY_NONE))
        {
            pdata8bits  = NULL;
            pdata16bits = (uint16_t *) pData;
        }
        else
        {
            pdata8bits  = pData;
            pdata16bits = NULL;
        }

        /* Check the remain data to be received */
        while (huart->RxXferCount > 0U)
        {
            if (UART_WaitOnFlagUntilTimeout(huart, UART_FLAG_RXNE, RESET, tickstart, Timeout) != HAL_OK)
            {
                huart->RxState = HAL_UART_STATE_READY;
                return HAL_TIMEOUT;
            }

            if (pdata8bits == NULL)
            {
                *pdata16bits = (uint16_t)(READ_REG(huart->Instance->DATAR) & 0x01FF);
                pdata16bits++;
            }
            else
            {
                if ((huart->Init.UART_WordLength == UART_WORDLENGTH_9B) ||
                    ((huart->Init.UART_WordLength == UART_WORDLENGTH_8B) && (huart->Init.UART_Parity == UART_PARITY_NONE)))
                {
                    *pdata8bits = (uint8_t)(READ_REG(huart->Instance->DATAR) & (uint8_t)0x00FF);
                }
                else
                {
                    *pdata8bits = (uint8_t)(READ_REG(huart->Instance->DATAR) & (uint8_t)0x007F);
                }
                pdata8bits++;
            }
            huart->RxXferCount--;
        }

        /* At end of Rx process, restore huart->RxState to Ready */
        huart->RxState = HAL_UART_STATE_READY;

        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Sends an amount of data in non blocking mode.
  * @note   When UART parity is not enabled (PCE = 0), and Word Length is configured to 9 bits (M1-M0 = 01),
  *         the sent data is handled as a set of u16. In this case, Size must indicate the number
  *         of u16 provided through pData.
  * @param  huart Pointer to a UART_HandleTypeDef structure that contains
  *               the configuration information for the specified UART module.
  * @param  pData Pointer to data buffer (u8 or u16 data elements).
  * @param  Size  Amount of data elements (u8 or u16) to be sent
  * @retval HAL status
  */
HAL_StatusTypeDef HAL_UART_Transmit_IT(UART_HandleTypeDef *huart, const uint8_t *pData, uint16_t Size)
{
    /* Check that a Tx process is not already ongoing */
    if (huart->gState == HAL_UART_STATE_READY)
    {
        if ((pData == NULL) || (Size == 0U))
        {
        return HAL_ERROR;
        }

        huart->pTxBuffPtr = pData;
        huart->TxXferSize = Size;
        huart->TxXferCount = Size;

        huart->ErrorCode = HAL_UART_ERROR_NONE;
        huart->gState = HAL_UART_STATE_BUSY_TX;

