truongtl/ch32v00x-hal-driver/src/ch32v00x_hal_uart.c
    /* Check that a Tx process is ongoing */
    if (huart->gState == HAL_UART_STATE_BUSY_TX)
    {
        if ((huart->Init.UART_WordLength == UART_WORDLENGTH_9B) && (huart->Init.UART_Parity == UART_PARITY_NONE))
        {
            tmp = (const uint16_t *) huart->pTxBuffPtr;
            WRITE_REG(huart->Instance->DATAR, (uint16_t)(*tmp & (uint16_t)0x01FF));
            huart->pTxBuffPtr += 2U;
        }
        else
        {
            WRITE_REG(huart->Instance->DATAR, (uint8_t)(*huart->pTxBuffPtr++ & (uint8_t)0x00FF));
        }

        if (--huart->TxXferCount == 0U)
        {
            /* Disable the UART Transmit Data Register Empty Interrupt */
            __HAL_UART_DISABLE_IT(huart, UART_IT_TXE);

            /* Enable the UART Transmit Complete Interrupt */
            __HAL_UART_ENABLE_IT(huart, UART_IT_TC);
        }
        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}

/**
  * @brief  Wraps up transmission in non blocking mode.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
static HAL_StatusTypeDef UART_EndTransmit_IT(UART_HandleTypeDef *huart)
{
    /* Disable the UART Transmit Complete Interrupt */
    __HAL_UART_DISABLE_IT(huart, UART_IT_TC);

    /* Tx process is ended, restore huart->gState to Ready */
    huart->gState = HAL_UART_STATE_READY;

    /*Call legacy weak Tx complete callback*/
    HAL_UART_TxCpltCallback(huart);

    return HAL_OK;
}

/**
  * @brief  Wraps up transmission in non blocking mode.
  * @param  huart  Pointer to a UART_HandleTypeDef structure that contains
  *                the configuration information for the specified UART module.
  * @retval HAL status
  */
static HAL_StatusTypeDef UART_Receive_IT(UART_HandleTypeDef *huart)
{
    uint8_t  *pdata8bits = NULL;
    uint16_t *pdata16bits = NULL;

    /* Check that a Rx process is ongoing */
    if (huart->RxState == HAL_UART_STATE_BUSY_RX)
    {
        if ((huart->Init.UART_WordLength == UART_WORDLENGTH_9B) && (huart->Init.UART_Parity == UART_PARITY_NONE))
        {
            /* Unused pdata8bits */
            UNUSED(pdata8bits);
            pdata16bits = (uint16_t *) huart->pRxBuffPtr;
            *pdata16bits = (uint16_t)(READ_REG(huart->Instance->DATAR) & (uint16_t)0x01FF);
            huart->pRxBuffPtr += 2U;
        }
        else
        {
            pdata8bits = (uint8_t *) huart->pRxBuffPtr;
            /* Unused pdata16bits */
            UNUSED(pdata16bits);

            if ((huart->Init.UART_WordLength == UART_WORDLENGTH_9B) ||
                ((huart->Init.UART_WordLength == UART_WORDLENGTH_8B) && (huart->Init.UART_Parity == UART_PARITY_NONE)))
            {
                *pdata8bits = (uint8_t)(READ_REG(huart->Instance->DATAR) & (uint8_t)0x00FF);
            }
            else
            {
                *pdata8bits = (uint8_t)(READ_REG(huart->Instance->DATAR) & (uint8_t)0x007F);
            }
            huart->pRxBuffPtr += 1U;
        }

        if (--huart->RxXferCount == 0U)
        {
            /* Disable the UART Data Register not empty Interrupt */
            __HAL_UART_DISABLE_IT(huart, UART_IT_RXNE);

            /* Disable the UART Parity Error Interrupt */
            __HAL_UART_DISABLE_IT(huart, UART_IT_PE);

            /* Disable the UART Error Interrupt: (Frame error, noise error, overrun error) */
            __HAL_UART_DISABLE_IT(huart, UART_IT_ERR);

            /* Rx process is completed, restore huart->RxState to Ready */
            huart->RxState = HAL_UART_STATE_READY;

            /*Call legacy weak Rx Event callback*/
            HAL_UART_RxCpltCallback(huart);

            return HAL_OK;
        }
        return HAL_OK;
    }
    else
    {
        return HAL_BUSY;
    }
}
